Revit 2027 API
FilterableValueProvider.IsStringValueSupported Method
 Determines whether the provide can provide a string value for the given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsStringValueSupported(
	Element element
)
Public Function IsStringValueSupported (
	element As Element
) As Boolean
public:
bool IsStringValueSupported(
	Element^ element
)
member IsStringValueSupported :
        element : Element -> bool
Parameters
element Element
 The element to query.
Return Value
Boolean
 True if the provider can return a string value for the given element, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterableValueProvider Class
Autodesk.Revit.DB Namespace